In [2]:
import pandas as pd
from sqlalchemy import create_engine

# connection string
engine = create_engine(
    "postgresql+psycopg2://udemy:udemy123@localhost:5434/udemy_master_of_pandas"
)

# read table
df = pd.read_sql("SELECT * FROM master.employees;", engine)

print(df.head())

  First Name  Gender Start Date Last Login Time  Salary  Bonus %  \
0    Douglas    Male   8/6/1993        12:42 PM   97308    6.945
1     Thomas    Male  3/31/1996         6:53 AM   61933    4.170
2      Maria  Female  4/23/1993        11:17 AM  130590   11.858
3      Jerry    Male   3/4/2005         1:00 PM  138705    9.340
4      Larry    Male  1/24/1998         4:47 PM  101004    1.389

  Senior Management             Team
0              True        Marketing
1              True             None
2             False          Finance
3              True          Finance
4              True  Client Services

In [3]:
df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,None
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,None,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [4]:
df = pd.read_sql("select * from master.employees" , engine , index_col=['First Name'])

In [5]:
df

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,None
Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...
Henry,None,11/23/2014,6:09 AM,132483,16.655,False,Distribution
Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [6]:
df.index

Index(['Douglas',  'Thomas',   'Maria',   'Jerry',   'Larry',  'Dennis',
          'Ruby',      None,  'Angela', 'Frances',
       ...
         'Robin',    'Rose', 'Anthony',    'Tina',  'George',   'Henry',
       'Phillip', 'Russell',   'Larry',  'Albert'],
      dtype='object', name='First Name', length=1000)

In [7]:
df.index.name

'First Name'

In [8]:
employees = pd.read_sql("select * from master.employees" , engine , index_col=['First Name' , 'Salary'])

In [9]:
employees

,,Gender,Start Date,Last Login Time,Bonus %,Senior Management,Team
First Name,Salary,,,,,,
Douglas,97308,Male,8/6/1993,12:42 PM,6.945,True,Marketing
Thomas,61933,Male,3/31/1996,6:53 AM,4.170,True,None
Maria,130590,Female,4/23/1993,11:17 AM,11.858,False,Finance
Jerry,138705,Male,3/4/2005,1:00 PM,9.340,True,Finance
Larry,101004,Male,1/24/1998,4:47 PM,1.389,True,Client Services
...,...,...,...,...,...,...,...
Henry,132483,None,11/23/2014,6:09 AM,16.655,False,Distribution
Phillip,42392,Male,1/31/1984,6:30 AM,19.675,False,Finance
Russell,96914,Male,5/20/2013,12:39 PM,1.421,False,Product
Larry,60500,Male,4/20/2013,4:45 PM,11.985,False,Business Development
Albert,129949,Male,5/15/2012,6:24 PM,10.169,True,Sales

In [10]:
employees.index

MultiIndex([('Douglas',  97308),
            ( 'Thomas',  61933),
            (  'Maria', 130590),
            (  'Jerry', 138705),
            (  'Larry', 101004),
            ( 'Dennis', 115163),
            (   'Ruby',  65476),
            (      nan,  45906),
            ( 'Angela',  95570),
            ('Frances', 139852),
            ...
            (  'Robin', 100765),
            (   'Rose', 134505),
            ('Anthony', 112769),
            (   'Tina',  56450),
            ( 'George',  98874),
            (  'Henry', 132483),
            ('Phillip',  42392),
            ('Russell',  96914),
            (  'Larry',  60500),
            ( 'Albert', 129949)],
           names=['First Name', 'Salary'], length=1000)

In [12]:
employees.index.name

In [13]:
employees.index.names

FrozenList(['First Name', 'Salary'])

In [14]:
employees.reset_index

<bound method DataFrame.reset_index of                    Gender  Start Date Last Login Time  Bonus %  \
First Name Salary
Douglas    97308     Male    8/6/1993        12:42 PM    6.945
Thomas     61933     Male   3/31/1996         6:53 AM    4.170
Maria      130590  Female   4/23/1993        11:17 AM   11.858
Jerry      138705    Male    3/4/2005         1:00 PM    9.340
Larry      101004    Male   1/24/1998         4:47 PM    1.389
...                   ...         ...             ...      ...
Henry      132483    None  11/23/2014         6:09 AM   16.655
Phillip    42392     Male   1/31/1984         6:30 AM   19.675
Russell    96914     Male   5/20/2013        12:39 PM    1.421
Larry      60500     Male   4/20/2013         4:45 PM   11.985
Albert     129949    Male   5/15/2012         6:24 PM   10.169

                  Senior Management                  Team
First Name Salary
Douglas    97308               True             Marketing
Thomas     61933               True                  None
Maria      130590             False               Finance
Jerry      138705              True               Finance
Larry      101004              True       Client Services
...                             ...                   ...
Henry      132483             False          Distribution
Phillip    42392              False               Finance
Russell    96914              False               Product
Larry      60500              False  Business Development
Albert     129949              True                 Sales

[1000 rows x 6 columns]>

In [15]:
employees

,,Gender,Start Date,Last Login Time,Bonus %,Senior Management,Team
First Name,Salary,,,,,,
Douglas,97308,Male,8/6/1993,12:42 PM,6.945,True,Marketing
Thomas,61933,Male,3/31/1996,6:53 AM,4.170,True,None
Maria,130590,Female,4/23/1993,11:17 AM,11.858,False,Finance
Jerry,138705,Male,3/4/2005,1:00 PM,9.340,True,Finance
Larry,101004,Male,1/24/1998,4:47 PM,1.389,True,Client Services
...,...,...,...,...,...,...,...
Henry,132483,None,11/23/2014,6:09 AM,16.655,False,Distribution
Phillip,42392,Male,1/31/1984,6:30 AM,19.675,False,Finance
Russell,96914,Male,5/20/2013,12:39 PM,1.421,False,Product
Larry,60500,Male,4/20/2013,4:45 PM,11.985,False,Business Development
Albert,129949,Male,5/15/2012,6:24 PM,10.169,True,Sales

In [16]:
employees.reset_index(inplace=True)

In [17]:
employees

,First Name,Salary,Gender,Start Date,Last Login Time,Bonus %,Senior Management,Team
0,Douglas,97308,Male,8/6/1993,12:42 PM,6.945,True,Marketing
1,Thomas,61933,Male,3/31/1996,6:53 AM,4.170,True,None
2,Maria,130590,Female,4/23/1993,11:17 AM,11.858,False,Finance
3,Jerry,138705,Male,3/4/2005,1:00 PM,9.340,True,Finance
4,Larry,101004,Male,1/24/1998,4:47 PM,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,132483,None,11/23/2014,6:09 AM,16.655,False,Distribution
996,Phillip,42392,Male,1/31/1984,6:30 AM,19.675,False,Finance
997,Russell,96914,Male,5/20/2013,12:39 PM,1.421,False,Product
998,Larry,60500,Male,4/20/2013,4:45 PM,11.985,False,Business Development
999,Albert,129949,Male,5/15/2012,6:24 PM,10.169,True,Sales

In [18]:
employees.set_index(['First Name'])

,Salary,Gender,Start Date,Last Login Time,Bonus %,Senior Management,Team
First Name,,,,,,,
Douglas,97308,Male,8/6/1993,12:42 PM,6.945,True,Marketing
Thomas,61933,Male,3/31/1996,6:53 AM,4.170,True,None
Maria,130590,Female,4/23/1993,11:17 AM,11.858,False,Finance
Jerry,138705,Male,3/4/2005,1:00 PM,9.340,True,Finance
Larry,101004,Male,1/24/1998,4:47 PM,1.389,True,Client Services
...,...,...,...,...,...,...,...
Henry,132483,None,11/23/2014,6:09 AM,16.655,False,Distribution
Phillip,42392,Male,1/31/1984,6:30 AM,19.675,False,Finance
Russell,96914,Male,5/20/2013,12:39 PM,1.421,False,Product
Larry,60500,Male,4/20/2013,4:45 PM,11.985,False,Business Development
Albert,129949,Male,5/15/2012,6:24 PM,10.169,True,Sales

In [19]:
employees

,First Name,Salary,Gender,Start Date,Last Login Time,Bonus %,Senior Management,Team
0,Douglas,97308,Male,8/6/1993,12:42 PM,6.945,True,Marketing
1,Thomas,61933,Male,3/31/1996,6:53 AM,4.170,True,None
2,Maria,130590,Female,4/23/1993,11:17 AM,11.858,False,Finance
3,Jerry,138705,Male,3/4/2005,1:00 PM,9.340,True,Finance
4,Larry,101004,Male,1/24/1998,4:47 PM,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,132483,None,11/23/2014,6:09 AM,16.655,False,Distribution
996,Phillip,42392,Male,1/31/1984,6:30 AM,19.675,False,Finance
997,Russell,96914,Male,5/20/2013,12:39 PM,1.421,False,Product
998,Larry,60500,Male,4/20/2013,4:45 PM,11.985,False,Business Development
999,Albert,129949,Male,5/15/2012,6:24 PM,10.169,True,Sales

In [20]:
employees.set_index(['First Name'] , inplace= True)

In [21]:
employees

,Salary,Gender,Start Date,Last Login Time,Bonus %,Senior Management,Team
First Name,,,,,,,
Douglas,97308,Male,8/6/1993,12:42 PM,6.945,True,Marketing
Thomas,61933,Male,3/31/1996,6:53 AM,4.170,True,None
Maria,130590,Female,4/23/1993,11:17 AM,11.858,False,Finance
Jerry,138705,Male,3/4/2005,1:00 PM,9.340,True,Finance
Larry,101004,Male,1/24/1998,4:47 PM,1.389,True,Client Services
...,...,...,...,...,...,...,...
Henry,132483,None,11/23/2014,6:09 AM,16.655,False,Distribution
Phillip,42392,Male,1/31/1984,6:30 AM,19.675,False,Finance
Russell,96914,Male,5/20/2013,12:39 PM,1.421,False,Product
Larry,60500,Male,4/20/2013,4:45 PM,11.985,False,Business Development
Albert,129949,Male,5/15/2012,6:24 PM,10.169,True,Sales

In [22]:
employees.index[0:10]

Index(['Douglas',  'Thomas',   'Maria',   'Jerry',   'Larry',  'Dennis',
          'Ruby',       nan,  'Angela', 'Frances'],
      dtype='object', name='First Name')

In [23]:
employees.reset_index(inplace=True)

In [24]:
employees.set_index(['First Name' , 'Salary'] , inplace = True)

In [25]:
employees

,,Gender,Start Date,Last Login Time,Bonus %,Senior Management,Team
First Name,Salary,,,,,,
Douglas,97308,Male,8/6/1993,12:42 PM,6.945,True,Marketing
Thomas,61933,Male,3/31/1996,6:53 AM,4.170,True,None
Maria,130590,Female,4/23/1993,11:17 AM,11.858,False,Finance
Jerry,138705,Male,3/4/2005,1:00 PM,9.340,True,Finance
Larry,101004,Male,1/24/1998,4:47 PM,1.389,True,Client Services
...,...,...,...,...,...,...,...
Henry,132483,None,11/23/2014,6:09 AM,16.655,False,Distribution
Phillip,42392,Male,1/31/1984,6:30 AM,19.675,False,Finance
Russell,96914,Male,5/20/2013,12:39 PM,1.421,False,Product
Larry,60500,Male,4/20/2013,4:45 PM,11.985,False,Business Development
Albert,129949,Male,5/15/2012,6:24 PM,10.169,True,Sales

In [26]:
employees.index[0]

('Douglas', np.int64(97308))

In [27]:
employees.index.get_level_values(0)

Index(['Douglas',  'Thomas',   'Maria',   'Jerry',   'Larry',  'Dennis',
          'Ruby',       nan,  'Angela', 'Frances',
       ...
         'Robin',    'Rose', 'Anthony',    'Tina',  'George',   'Henry',
       'Phillip', 'Russell',   'Larry',  'Albert'],
      dtype='object', name='First Name', length=1000)

In [28]:
employees.index.get_level_values(1)

Index([ 97308,  61933, 130590, 138705, 101004, 115163,  65476,  45906,  95570,
       139852,
       ...
       100765, 134505, 112769,  56450,  98874, 132483,  42392,  96914,  60500,
       129949],
      dtype='int64', name='Salary', length=1000)

In [29]:
employees.index.get_level_values(0)[0:10]

Index(['Douglas',  'Thomas',   'Maria',   'Jerry',   'Larry',  'Dennis',
          'Ruby',       nan,  'Angela', 'Frances'],
      dtype='object', name='First Name')